Revit 2027 API
StructuralSectionGeneralShape Enumeration
 General shapes for structural sections.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StructuralSectionGeneralShape
Public Enumeration StructuralSectionGeneralShape
public enum class StructuralSectionGeneralShape
type StructuralSectionGeneralShape
Members
Member name | Value | Description
GeneralC | 2 |  Defines parameters for Channel Cold Formed structural sections.
GeneralCEx | 11 |  Defines parameters for Channel With Fold Cold Formed structural sections.
GeneralF | 10 |  Defines parameters for Flat Bar structural sections.
GeneralH | 7 |  Defines parameters for Rectangular Pipe structural sections.
GeneralI | 1 |  Defines parameters for Double T structural sections.
GeneralLA | 4 |  Defines parameters for Angle Cold Formed structural sections.
GeneralLZ | 12 |  Defines parameters for Z Cold Formed structural sections.
GeneralR | 9 |  Defines parameters for Pipe structural sections.
GeneralS | 8 |  Defines parameters for Round Bar structural sections.
GeneralT | 6 |  Defines parameters for Tees structural sections.
GeneralU | 3 |  Defines parameters for Channel structural sections.
GeneralW | 5 |  Defines parameters for Angle structural sections.
NotDefined | 0 |  General shape is not defined.
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace